{"class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "dtype": "float32", "batch_input_shape": [null, 28, 28], "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "units": 512, "batch_input_shape": [null, 784], "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "relu", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.5, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_2", "use_bias": true, "units": 512, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "rate": 0.5, "noise_shape": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_3", "use_bias": true, "units": 10, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential_1"}, "keras_version": "2.2.4"}