{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Flatten", "config": {"name": "flatten_1", "batch_input_shape": [null, 28, 28], "trainable": true, "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Dense", "config": {"trainable": true, "units": 512, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "batch_input_shape": [null, 784], "bias_constraint": null, "dtype": "float32"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "units": 512, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "name": "dense_2", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "units": 10, "activation": "softmax", "use_bias": true, "kernel_regularizer": null, "name": "dense_3", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null}}]}}